/*
Проверочная работа
Что требуется:

1 Создать репозиторий на GitHub
2 Создать readme-файл c описанием основных пунктов решения задачи.
3 Дополнительно добавить в репозиторий блок-схему с алгоритмом
    самой сложной(по вашему мнению) части задачи из п.2
4 Написать программу, решающую поставленную задачу
5 Вся работа разбивается на логические единицы зафиксированнаые отдельным коммитом

Задача: Написать программу, которая из сформированного массива строк
    содержащих символы и числа создать массив из строк,
    в который попадут только символы, не являющиеця цифрами.

Входные данные можно получить путём ввода с клавиатуры, но лучше сделать автогенерацию данных.
При решении не использовать "читерство".

Решение:
1 написать метод создания массива
2 написать метод заполнения массива сгенерированных данных.
3 написать метод сортитровки массива на символы и числа.
4 написать метод распечатки массива строк.
5 заполнить методы значениями.
*/


string [] CreateArray(int size)
{
return array;
}


void FillArray(string[]array)
{

}


void SortArray(string[]array)
{

}


void PrintArray(string[]array)
{

}


int size = 10;
string[] array = CreateArray(size);
FillArray(array);
SortArray(array);
PrintArray(array);
